{
    "family": [
        {
            "name": "Clifton Robinson Dixon",
            "dates": "16 October 1917 - 15 May 2008",
            "birthplace": "Manard, Camas, Idaho, United States",
            "deathplace": "Heber City, Wasatch, Utah, United States",
            "story": "Love my country, fear my government is what he told me frequently. He used to call me Sweet Sue.",
            "image": "images/clifton.webp",
            "lat":"43.27757347001356",
            "lng":"-114.7460036328431"
        },
        {
            "name": "Thelda Thompson",
            "dates": "12 December 1915 - 19 May 2008",
            "birthplace": "Georgetown, Bear Lake, Idaho, United States",
            "deathplace": "Heber City, Wasatch, Utah, United States",
            "story": "Oh, happy day. Our dear mother went to join her husband just four days after he passed away. She died Monday, May 19, 2008, at the age of 92 in Heber City, Utah. Thelda was born Dec. 12, 1915, in Georgetown. She is the second daughter of Abraham Martin Thompson and Mabel Elizabeth Larsen. She graduated from Georgetown High School as valedictorian of her class and from Utah State University with a Bachelor of Science in business education. She married Clifton Robinson Dixon from Gooding on June 12, 1944, in the Salt Lake LDS Temple. She was an active member of the LDS Church and served in many positions of service and leadership. She served a mission with Clifton as senior missionaries in the Washington D.C. North Mission from 1993 to 1994. Her occupations included business teacher in Alamo, Nev., and Salmon,and being a wonderful mother. She is preceded in death by her husband; a daughter, Janice Dixon; a great-grandson, Garrett Reese Wright; her parents; a sister, Thora Black; and three brothers, Earl, Wayne and Darwin Thompson. She is survived by five children, Dee (Cathie Hendrix) Dixon, Wilma (John) Cowley, Reese (Connie Jones) Dixon, Marva Lee (Steve) Edwards and Joel (Amy Durant) Dixon; 22 grandchildren; 37 great-grandchildren; and one great-great-grandchild. She is also survived by two sisters, Elma Fraughton and VeNona (Charles) Stephens; and one brother, Gary (Ruth) Thompson.",
            "image": "images/thelda.webp",
            "lat":"42.47729873118396",
            "lng":"-111.37176986477049"
        },
        {
            "name": "Finley Reid Hendrix",
            "dates": "10 April 1919 - 6 March 2002",
            "birthplace": "Lund, White Pine, Nevada, United States",
            "deathplace": "Heber City, Wasatch, Utah, United States",
            "story": "Finley Reid Hendrix: Born April 10,1919 died March 6,2002. Lived on a ranch 35 miles from Lund, Nevada, USA. Served a Mission for The Church of Jesus Christ of Latter-Day Saints age 19-21 Southern States where he met his future wife, Juanita McLeod. They married and lived on the Nevada ranch working the ranch with his father and brothers for many years. World War II broke while Finley was serving his Mission, then shortly after his marriage he was drafted into the US Army serving as a cook in a medical unit. The oldest daughter LaRose was born during his 2 1/2 years of military service. Grandpa Ervin Hendrix and his brothers bought a store in McGill Nevada when Finley was a young boy. Finley went to the store (circa 1946) to cut meat and did some management, this only lasted for a few months. Danny was born while living in McGill. At some point after 1951, before 1957 (I could not find any dates) the ranch was sold, and the brothers went their way. Finley and his family went to South Carolina where Juanita was born and raised so they could a start a new life. A third and fourth daughter was born, Cathy and Vicki, Vicki just a baby when they went to South Carolina. The sale of the Nevada Ranch went into default and the families returned to the ranch before Finley could get established in South Carolina. The family lived on the ranch and the children attended school on the ranch for a few years then the family started living in Lund for the school year so the children could get a better education. The last child, a daughter Margaret (named after her grandmother Hendrix) was born in 1957. The ranch was sold again in 1959 to the Nevada State Fish and Game for a game preserve so Finley went back to South Carolina, his brother Ed went to Idaho to ranch, his brother Clay stayed in Lund, Nevada and transported by truck, cattle to the California market, His brother Vernon stayed at home with his now retired parents. Finley while in South Carolina went into business with a partner (his brother-in-law) in a furniture store. The furniture business failed, and Finley lost his ranch money investment, so the family left South Carolina and purchased an 80-acre dairy farm near Gooding Idaho circa 1961. Finley lost the health of his spine and had surgery on a spine disc that forced him to sell the dairy farm and begin a new life not requiring a strong back. He sold insurance for one summer season then, went to work as a retail shoe salesman. The family relocated to Heber City Utah in April 1968, Finley still working as a shoe department manager for a retail store in Heber. While in Heber City LaRose started college at BYU, Danny returned from LDS Missionary service and was married, Cathy was married to a boy she met while living in Gooding, LaRose was married. Finley went to a job at a larger retail store in Provo, so he and LaRose commuted to Provo for a few years. Finley and his family relocated to Orem, Utah where they purchased a 14 X 70 mobile home and lived in a mobile home court. Finley was now a manager at a new retail store in Orem, Utah. Vicki got married to a boy from Heber leaving Finley with only one child at home. Finley decided he wanted to own his own Western Apparel store, so LaRose, Danny and Finley took out a loan and opened Fin's Reata in Heber City, Utah June 1974. They moved the mobile home to Heber living in a court for a few months then rented an old home on 4th South and Main where they lived until moving to Lund. The last child, Margret was married in this era. Granda and Grandma Hendrix could enjoy their young grandchildren and worry about the success of their store. Finley and Juanita operated the store for several years until his mother died giving them an opportunity to relocate to Lund, Nevada (Finley's dream retirement) and purchase Grandma Maggie's house. The store in Heber was still a financial struggle but they decided to leave the store and retire to Lund, Nevada. The store, Fin's Reata was closed, and the debt eventually retired. Finley and Juanita moved to Lund in 1985, staying for about 10 years until both of them were in need of health care. They moved back to Heber City to a house on Center Street for a few years. Finley was diagnosed with Parkinson's disease and Juanita had suffered with diabetes for several years. Their health failing faster sold the house on Center Street to a grandson and moved to a house on first south next door to LaRose and her Husband Robert Hiatt. Their health failure was so needy that Vicki left her employment so she could tend to their needs on a fulltime basis. LaRose cared for their needs every morning and every bedtime until they were both admitted into a long-term facility. Within weeks Finley died, Juanita was by then suffering with dementia and died about three months later. Written by Robert K Giles, husband to Vicki Hendrix. February 28, 2022",
            "image": "images/finley.webp",
            "lat":"38.85834244007753",
            "lng":"-115.00568575242833"
        },
        {
            "name": "Juanita McLeod",
            "dates": "15 November 1923 - 4 June 2002",
            "birthplace": "Privateer, Sumter, South Carolina, United States",
            "deathplace": "Heber City, Wasatch, Utah, United States",
            "story": "She was the sweetest grandma with the best southern accent!",
            "image": "images/juanita.webp",
            "lat":"33.81675079805856",
            "lng":"-80.39894791713125"
        },
        {
            "name": "Riley Lyman Dixon",
            "dates": "10 January 1884 - 23 November 1976",
            "birthplace": "Clifton, Oneida, Idaho, United States",
            "deathplace": "Murray, Salt Lake, Utah, United States",
            "story": "I was born in Clifton, Idaho on January 19, 1884. I was the 5th child of Father’s 2nd wife, Susan Harmon, as he was a polygamist. There were 19 children in the two families. When I was 2 years old Father took my mother and our family and moved to Star Valley to elude the Utah authorities. Father would not abandon one of his families because he was a polygamist. We lived in a log cabin for 15 years with a dirt floor and a dirt roof. Five more children were born here. When I was 15 years old our family moved to Bliss and then to Manard, Idaho. When the Mormon Reservoir was built I became the Ditch Rider. At a later date I was elected secretary and treasure of the Twin lakes Res. Co. One day upon returning from working on the open stock range between Bliss and Fir Grove, my Father called me in and told me to get ready to accompany my older half-brother, Asael. He was to leave the next morning to attend the Brigham Young Academy in Logan, Utah. While there I cut hair to help with my expenses but chose carpentry as my profession. This training served me well throughout my life as I built two of our homes. I also cut the family’s hair until they were pretty well grown. We had work horses for the farm machinery. I enjoyed the challenge of spirited horses and always had a good many of them around. I would always rather use a mean horse than a tired one until our boys, Clifton and Dwight, began to have the same troubles. I thought I had had enough so sold the bad horses and got a tractor in 1935. We appreciated good saddle horses as they were an important means of transportation. Probably the two the children remember the best ere “Black Beauty” and (old) Boots. All of the children remember many happy hours riding them to school and to do chores around the place. Riley met his wife on Camas Prairie while she was visiting her sister Elizabeth (Lizzie) and brother John in the summer of 1915. He traveled to Paragonah by train to meet the family. They were married in the Salt Lake Temple October 4, 1916. Prior to the marriage, Riley had homesteaded land west of Manard. He built a small home on the ranch. He was a trained carpenter. He added more rooms as the family grew to include 6 children. All the children were born in that house. The Winters were very harsh on Camas Prairie. The snow would get so deep the children used a covered sleigh in which to get to school. I contrived a stove in the middle by which they were able to keep warm with heavy coats, hats, gloves, and quilts. In 1935-36 our family moved to Gooding so the children could more easily go to school. I build a log house on 7th Ave and California Street. The children were now able to walk only a few block to their schools. There was much more room as the home had a basement and a rather large attic bedroom. There was a small “Bath” room off the kitchen in the ranch house. The round tin tub was for real…bathing. Further accommodations (out house) were outside. I went into partnership with my son, Clifton, and his family on a farm east of Gooding. When we first moved to Gooding the ward met in a small chapel. There were curtains strung on wires that divided it for classrooms. I was called to be Bishop in 1941. One of my top priorities was to build a new chapel. I turned the last shovel of dirt at the completion of our new chapel in 1949. I served as Bishop of the Gooding Ward for 8 years. This chapel, some years later, burn to the ground. While serving as Bishop we sold our log house in Gooding and Bought a farm 4 miles northeast of town. We had disposed of most of our livestock and just kept a few cattle. We no longer moved back to Camas Prairie for the summers as we had consistently done since moving to Gooding. We had many happy years here and most of the children married and moved away from this home. In 1948, I had a farm accident and doubted I would be able to keep up the farm. Our daughter, Lois, was living with us and working in town. So, again we bought a home in Gooding at 229 West 12th Ave. We remained in this home the rest of our days. In 1947, my wife and I accompanied by our daughter, Lois, flew to New York City to meet our second son, Dwight, upon his release from the Eastern States mission. I always took a deep interest in advancements of the day and this was an exciting experience for us. I lived to be almost 93 years old and my life spanned a marvelous age. As a child I lived in a log cabin with a dirt floor and roof and lived to fly some 3,000 miles away for a pleasure trip. Our children gave us a 50th wedding anniversary celebration in the Gooding, Idaho ward building. I feel very fortunate to have spent over 60 years together. Our 60th wedding anniversary was held by the family at Midgley Manor in Murray, Utah. We were called on a mission for the Church of Jesus Christ of Latter-Day Saints, but we were unable to go because it was discovered that I had Parkinson's Disease. My illness made my last 10+ years very limited. However, I had a very good nurse, Alva, and she took very good care of me. Riley passed away at his daughter’s home in Murray, Utah in 1979.",
            "image": "images/riley.webp",
            "lat":"42.19072270852785",
            "lng":"-112.00791537142841"
        },
        {
            "name": "Alva Retta Robinson",
            "dates": "27 August 1893 - 23 April 1980",
            "birthplace": "Paragonah, Iron, Utah Territory, United States",
            "deathplace": "Murray, Salt Lake, Utah, United States",
            "story": "No story yet.",
            "image": "images/alva.webp",
            "lat":"37.88528626480343",
            "lng":"-112.77464789865607"
        },
        {
            "name": "Abraham Martin Thompson",
            "dates": "18 December 1891 - 12 January 1985",
            "birthplace": "Bloomington, Bear Lake, Idaho, United States",
            "deathplace": "Las Vegas, Clark, Nevada, United States",
            "story": "No story yet.",
            "image": "images/abraham.webp",
            "lat":"42.19241989290724",
            "lng":"-111.40202679809939"
        },
        {
            "name": "Mabel Elizabeth Larsen",
            "dates": "2 April 1893 - 2 October 1982",
            "birthplace": "Georgetown, Bear Lake, Idaho, United States",
            "deathplace": "Montpelier, Bear Lake, Idaho, United States",
            "story": "No story yet.",
            "image": "images/mabel.webp",
            "lat":"42.47729873118396",
            "lng":"-111.37176986477049"
        },
        {
            "name": "Ervin Lester Hendrix",
            "dates": "13 September 1891 - 21 March 1970",
            "birthplace": "St. George, Washington, Utah, United States",
            "deathplace": "Ely, White Pine, Nevada, United States",
            "story": "No story yet.",
            "image": "images/ervin.webp",
            "lat":"37.086094000272524",
            "lng":"-113.58112170896521"
        },
        {
            "name": "Margaret Reid",
            "dates": "24 December 1890 - 15 March 1984",
            "birthplace": "Manti, Sanpete, Utah, United States",
            "deathplace": "Ely, White Pine, Nevada, United States",
            "story": "No Story yet.",
            "image": "images/margaret.webp",
            "lat":"39.26783133681734",
            "lng":"-111.63333011995778"
        },
        {
            "name": "Richard Stakely McLeod",
            "dates": "3 June 1883 - 8 May 1959",
            "birthplace": "Privateer, Sumter, South Carolina, United States",
            "deathplace": "Sumter, Sumter, South Carolina, United States",
            "story": "No Story yet.",
            "image": "images/richard.webp",
            "lat":"33.81675079805856",
            "lng":"-80.39894791713125"
        },
        {
            "name": "Mollie Steely Geddings",
            "dates": "25 August 1887 - 28 October 1954",
            "birthplace": "Sumter, Sumter, South Carolina, United States",
            "deathplace": "Sumter, Sumter, South Carolina, United States",
            "story": "Mollie Steely Geddings was born on the 25th of August, 1887.  In Sumter, South Carolina, she was born to Rebecca and John Edward Geddings.  She was married to Richard Stakely Mcleod on the 10th of May, 1904.  They had eight children together, six of those children growing to adulthood.  She was baptized a member of The Church of Jesus Christ of Latter-Day Saints on the 13th of January, 1914.  Because the temple was so far away, she and Richard would not be sealed until 1948.  They traveled to the Salt Lake Temple to be sealed, but because of the distance, none of their children could be sealed to them at this time.  Their children were sealed to them after both Mollie and Richard passed away, starting with my grandmother, Juanita, in 1965.  The other children would be sealed to their parents either after their own deaths or after the Washington D.C. Temple was completed. I interviewed Mollie’s granddaughter, Cathie, to gather memories she had of her grandmother.  Mollie was known for her strong testimony of the gospel of Jesus Christ.  Cathie said that the song “Israel, Israel, God Is Calling” always takes her right back to her grandmother’s side, singing above a bicycle shop where they met for church.  She remembers her grandmother had a powerful testimony and a pleasant spirit.  She was short with fuzzy white hair and always busy.  She was mainly occupied with her grandchildren.  She would freeze milk and then make milk slushies for the kids, and she would give each one a hard spaghetti stick, and they would pretend they had a magic wand.  She always made life fun for her grandchildren.  Mollie loved animals, she had many dogs and cats, and she also raised chickens and had a milk cow. They lived on a large farm where Richard was a foreman over watermelon and cotton crops; they had mule teams that would haul the wagons full of the harvest.  The home was a typical southern farm home, built up on stilts.  The only heat came from the home's fireplaces.  They had running water in the bathrooms for showers but no toilets; they had an outhouse and chamber pots used only at night.  The kitchen sink was located on the back porch just outside the kitchen.  Cathie remembers watching her grandmother clean and prepare the chicken for dinner at that sink.  Cathie loved her grandmother and was grateful for her time with her.  On the 31st of October 1954, Mollie passed away; Cathie was six years old. Citation Cathie Hendrix Dixon (Nampa, Idaho), interview by Sarah D. Mecham, 6 May 2022; transcript privately held by Sarah D. Mecham, South Jordan, Utah, 2022.",
            "image": "images/mollie.webp",
            "lat":"33.92394140280906",
            "lng":"-80.33908834138623"
        },
        {
            "name": "Janice Dixon",
            "dates": "20 January 1951 - 12 February 2004",
            "birthplace": "Gooding, Gooding, Idaho, United States",
            "deathplace": "Idaho Falls, Bonneville, Idaho, United States",
            "story": "No story yet.",
            "image": "images/janice.webp",
            "lat":"42.93930702406539",
            "lng":"-114.71179875745304"
        },
        {
            "name": "Iral Fay Mecham",
            "dates": "12 April 1913 - 25 June 1999",
            "birthplace": "Preston, Franklin, Idaho, United States",
            "deathplace": "Salt Lake City, Salt Lake, Utah, United States",
            "story": "No story yet.",
            "image": "images/iral.webp",
            "lat":"42.097817079486326",
            "lng":"-111.87287358350932"
        },
        {
            "name": "Anna Rogers",
            "dates": "21 October 1913 - 28 November 2000",
            "birthplace": "Lewiston, Cache, Utah, United States",
            "deathplace": "South Jordan, Salt Lake County, Utah, United States",
            "story": "No story yet.",
            "image": "images/anna.webp",
            "lat":"41.97548958110855",
            "lng":"-111.85978535349382"
        },
        {
            "name": "Robert Herbert Austin",
            "dates": "7 September 1923 - 15 April 2008",
            "birthplace": "Lehi, Utah, Utah, United States",
            "deathplace": "Meridian, Ada, Idaho, United States",
            "story": "No story yet.",
            "image": "images/robert.webp",
            "lat":"40.39044146250346",
            "lng":"-111.84854777177368"
        },
        {
            "name": "Gladys Pearl Fairbourne",
            "dates": "8 March 1926 - 16 February 2008",
            "birthplace": "Salt Lake City, Salt Lake, Utah, United States",
            "deathplace": "Meridian, Ada, Idaho, United States",
            "story": "No story yet.",
            "image": "images/gladys.webp",
            "lat":"40.76157937508852",
            "lng":"-111.90449263842635"
        }
    ]
}